<?xml version="1.0"?>
<GCC_XML version="0.9.0" cvs_revision="1.139">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10 _11 _12 _13 _14 _15 _16 _17 _18 _19 _20 _21 _22 _23 _24 _25 _26 _27 _28 _29 _30 _31 _32 _33 _34 _35 _36 _37 _38 _39 _40 _41 _42 _43 _44 _45 _46 _47 _48 _49 _50 _51 _52 _53 _54 _55 _56 _57 _58 _59 _60 _61 _62 _63 _64 _65 _66 _67 _68 _69 _70 _71 _72 _73 _74 _75 _76 _77 _78 _79 _80 _81 _82 _83 _84 _85 _86 _87 _88 _89 _90 _91 _92 _93 _94 _95 _96 _97 _98 _99 _100 _101 _102 _103 _104 _105 _106 _107 _108 _109 _110 _111 _112 _113 _114 _115 _116 _117 _118 _119 _120 _121 _122 _123 _124 _125 _126 _127 _128 _129 _130 _131 _132 _133 _134 _135 _136 _137 _138 _139 _140 _141 _142 _143 _144 _145 _146 _147 _148 _149 _150 _151 _152 _153 _154 _155 _156 _157 _158 _159 _160 _161 _162 _163 _164 _165 _166 _167 _168 _169 _170 _171 _172 _173 _174 _175 _176 _177 _178 _179 _180 _181 _182 _183 _184 _185 _186 _187 _188 _189 _190 _191 _192 _193 _194 _195 _196 _197 _198 _199 _200 _201 _202 _203 _204 _205 _206 _207 _208 _209 _210 _211 _212 _213 _214 _215 _216 _217 _218 _219 _220 _221 _222 _223 _224 _225 _226 _227 _228 _229 _230 _231 _232 _233 _234 _235 _236 _237 _238 _239 _240 _241 _242 _243 _244 _245 _246 _247 _248 _249 _250"/>
  <Typedef id="_2" name="__int128_t" type="_251" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_252" context="_1" location="f0:0" file="f0" line="0"/>

    <Argument name="s" type="_265" location="f10:485" file="f10" line="485"/>
    <Argument name="iov" type="_329" location="f10:485" file="f10" line="485"/>
    <Argument name="count" type="_8" location="f10:485" file="f10" line="485"/>
    <Argument name="flags" type="_258" location="f10:485" file="f10" line="485"/>
  </Function>
  <Function id="_234" name="zmq_recviov" returns="_258" context="_1" location="f10:486" file="f10" line="486" mangled="_Z11zmq_recviov">
    <Argument name="s" type="_265" location="f10:486" file="f10" line="486"/>
    <Argument name="iov" type="_329" location="f10:486" file="f10" line="486"/>
    <Argument name="count" type="_323" location="f10:486" file="f10" line="486"/>
    <Argument name="flags" type="_258" location="f10:486" file="f10" line="486"/>
  </Function>
  <Function id="_235" name="zmq_z85_encode" returns="_253" context="_1" location="f10:493" file="f10" line="493" mangled="_Z14zmq_z85_encode">
    <Argument name="dest" type="_253" location="f10:493" file="f10" line="493"/>
    <Argument name="data" type="_330" location="f10:493" file="f10" line="493"/>
    <Argument name="size" type="_8" location="f10:493" file="f10" line="493"/>
  </Function>
  <Function id="_236" name="zmq_z85_decode" returns="_331" context="_1" location="f10:496" file="f10" line="496" mangled="_Z14zmq_z85_decode">
    <Argument name="dest" type="_331" location="f10:496" file="f10" line="496"/>
    <Argument name="string" type="_312" location="f10:496" file="f10" line="496"/>
  </Function>
  <Function id="_237" name="zmq_curve_keypair" returns="_258" context="_1" location="f10:500" file="f10" line="500" mangled="_Z17zmq_curve_keypair">
    <Argument name="z85_public_key" type="_253" location="f10:500" file="f10" line="500"/>
    <Argument name="z85_secret_key" type="_253" location="f10:500" file="f10" line="500"/>
  </Function>
  <Function id="_238" name="zmq_curve_public" returns="_258" context="_1" location="f10:504" file="f10" line="504" mangled="_Z16zmq_curve_public">
    <Argument name="z85_public_key" type="_253" location="f10:504" file="f10" line="504"/>
    <Argument name="z85_secret_key" type="_312" location="f10:504" file="f10" line="504"/>
  </Function>
  <Function id="_239" name="zmq_atomic_counter_new" returns="_265" context="_1" location="f10:510" file="f10" line="510" mangled="_Z22zmq_atomic_counter_new"/>
  <Function id="_240" name="zmq_atomic_counter_set" returns="_303" context="_1" location="f10:511" file="f10" line="511" mangled="_Z22zmq_atomic_counter_set">
    <Argument name="counter" type="_265" location="f10:511" file="f10" line="511"/>
    <Argument name="value" type="_258" location="f10:511" file="f10" line="511"/>
  </Function>
  <Function id="_241" name="zmq_atomic_counter_inc" returns="_258" context="_1" location="f10:512" file="f10" line="512" mangled="_Z22zmq_atomic_counter_inc">
    <Argument name="counter" type="_265" location="f10:512" file="f10" line="512"/>
  </Function>
  <Function id="_242" name="zmq_atomic_counter_dec" returns="_258" context="_1" location="f10:513" file="f10" line="513" mangled="_Z22zmq_atomic_counter_dec">
    <Argument name="counter" type="_265" location="f10:513" file="f10" line="513"/>
  </Function>
  <Function id="_243" name="zmq_atomic_counter_value" returns="_258" context="_1" location="f10:514" file="f10" line="514" mangled="_Z24zmq_atomic_counter_value">
    <Argument name="counter" type="_265" location="f10:514" file="f10" line="514"/>
  </Function>
  <Function id="_244" name="zmq_atomic_counter_destroy" returns="_303" context="_1" location="f10:515" file="f10" line="515" mangled="_Z26zmq_atomic_counter_destroy">
    <Argument name="counter_p" type="_332" location="f10:515" file="f10" line="515"/>
  </Function>
  <Function id="_245" name="zmq_stopwatch_start" returns="_265" context="_1" location="f10:528" file="f10" line="528" mangled="_Z19zmq_stopwatch_start"/>
  <Function id="_246" name="zmq_stopwatch_stop" returns="_257" context="_1" location="f10:532" file="f10" line="532" mangled="_Z18zmq_stopwatch_stop">
    <Argument name="watch_" type="_265" location="f10:532" file="f10" line="532"/>
  </Function>
  <Function id="_247" name="zmq_sleep" returns="_303" context="_1" location="f10:535" file="f10" line="535" mangled="_Z9zmq_sleep">
    <Argument name="seconds_" type="_258" location="f10:535" file="f10" line="535"/>
  </Function>
  <Typedef id="_248" name="zmq_thread_fn" type="_333" context="_1" location="f10:537" file="f10" line="537"/>
  <Function id="_249" name="zmq_threadstart" returns="_265" context="_1" location="f10:540" file="f10" line="540" mangled="_Z15zmq_threadstart">
    <Argument name="func" type="_334" location="f10:540" file="f10" line="540"/>
    <Argument name="arg" type="_265" location="f10:540" file="f10" line="540"/>
  </Function>
  <Function id="_250" name="zmq_threadclose" returns="_303" context="_1" location="f10:543" file="f10" line="543" mangled="_Z15zmq_threadclose">
    <Argument name="thread" type="_265" location="f10:543" file="f10" line="543"/>
  </Function>
  <FundamentalType id="_251" name="__int128" size="128" align="128"/>
  <FundamentalType id="_252" name="unsigned __int128" size="128" align="128"/>
  <PointerType id="_253" type="_335"/>
  <CvQualifiedType id="_253r" type="_253" restrict="1"/>
  <ArrayType id="_254" min="0" max="0" type="_336"/>
  <PointerType id="_255" type="_258"/>
  <CvQualifiedType id="_255r" type="_255" restrict="1"/>
  <FundamentalType id="_256" name="long int" size="64" align="64"/>
  <FundamentalType id="_257" name="long unsigned int" size="64" align="64"/>
  <FundamentalType id="_258" name="int" size="32" align="32"/>
  <FundamentalType id="_259" name="unsigned char" size="8" align="8"/>
  <FundamentalType id="_260" name="short unsigned int" size="16" align="16"/>
  <FundamentalType id="_261" name="unsigned int" size="32" align="32"/>
  <FundamentalType id="_262" name="signed char" size="8" align="8"/>
  <FundamentalType id="_263" name="short int" size="16" align="16"/>
  <Field id="_264" name="__val" type="_337" context="_34" access="public" location="f3:134" file="f3" line="134" offset="0"/>
  <PointerType id="_265" type="_303"/>
  <CvQualifiedType id="_265r" type="_265" restrict="1"/>
  <PointerType id="_266" type="_22"/>
  <Field id="_267" name="_flags" type="_258" context="_63" access="public" location="f4:242" file="f4" line="242" offset="0"/>
  <Field id="_268" name="_IO_read_ptr" type="_253" context="_63" access="public" location="f4:247" file="f4" line="247" offset="64"/>
  <Field id="_269" name="_IO_read_end" type="_253" context="_63" access="public" location="f4:248" file="f4" line="248" offset="128"/>
  <Field id="_270" name="_IO_read_base" type="_253" context="_63" access="public" location="f4:249" file="f4" line="249" offset="192"/>
  <Field id="_271" name="_IO_write_base" type="_253" context="_63" access="public" location="f4:250" file="f4" line="250" offset="256"/>
  <Field id="_272" name="_IO_write_ptr" type="_253" context="_63" access="public" location="f4:251" file="f4" line="251" offset="320"/>
  <Field id="_273" name="_IO_write_end" type="_253" context="_63" access="public" location="f4:252" file="f4" line="252" offset="384"/>
  <Field id="_274" name="_IO_buf_base" type="_253" context="_63" access="public" location="f4:253" file="f4" line="253" offset="448"/>
  <Field id="_275" name="_IO_buf_end" type="_253" context="_63" access="public" location="f4:254" file="f4" line="254" offset="512"/>
  <Field id="_276" name="_IO_save_base" type="_253" context="_63" access="public" location="f4:256" file="f4" line="256" offset="576"/>
  <Field id="_277" name="_IO_backup_base" type="_253" context="_63" access="public" location="f4:257" file="f4" line="257" offset="640"/>
  <Field id="_278" name="_IO_save_end" type="_253" context="_63" access="public" location="f4:258" file="f4" line="258" offset="704"/>
  <Field id="_279" name="_markers" type="_338" context="_63" access="public" location="f4:260" file="f4" line="260" offset="768"/>
  <Field id="_280" name="_chain" type="_314" context="_63" access="public" location="f4:262" file="f4" line="262" offset="832"/>
  <Field id="_281" name="_fileno" type="_258" context="_63" access="public" location="f4:264" file="f4" line="264" offset="896"/>
  <Field id="_282" name="_flags2" type="_258" context="_63" access="public" location="f4:268" file="f4" line="268" offset="928"/>
  <Field id="_283" name="_old_offset" type="_31" context="_63" access="public" location="f4:270" file="f4" line="270" offset="960"/>
  <Field id="_284" name="_cur_column" type="_260" context="_63" access="public" location="f4:274" file="f4" line="274" offset="1024"/>
  <Field id="_285" name="_vtable_offset" type="_262" context="_63" access="public" location="f4:275" file="f4" line="275" offset="1040"/>
  <Field id="_286" name="_shortbuf" type="_339" context="_63" access="public" location="f4:276" file="f4" line="276" offset="1048"/>
  <Field id="_287" name="_lock" type="_340" context="_63" access="public" location="f4:280" file="f4" line="280" offset="1088"/>
  <Field id="_288" name="_offset" type="_32" context="_63" access="public" location="f4:289" file="f4" line="289" offset="1152"/>
  <Field id="_289" name="__pad1" type="_265" context="_63" access="public" location="f4:297" file="f4" line="297" offset="1216"/>
  <Field id="_290" name="__pad2" type="_265" context="_63" access="public" location="f4:298" file="f4" line="298" offset="1280"/>
  <Field id="_291" name="__pad3" type="_265" context="_63" access="public" location="f4:299" file="f4" line="299" offset="1344"/>
  <Field id="_292" name="__pad4" type="_265" context="_63" access="public" location="f4:300" file="f4" line="300" offset="1408"/>
  <Field id="_293" name="__pad5" type="_8" context="_63" access="public" location="f4:302" file="f4" line="302" offset="1472"/>
  <Field id="_294" name="_mode" type="_258" context="_63" access="public" location="f4:303" file="f4" line="303" offset="1536"/>
  <Field id="_295" name="_unused2" type="_341" context="_63" access="public" location="f4:305" file="f4" line="305" offset="1568"/>
  <Field id="_296" name="__count" type="_258" context="_66" access="public" location="f6:84" file="f6" line="84" offset="0"/>
  <Union id="_297" name="" context="_66" location="f6:85" file="f6" line="85" members="_342 _343" size="32" align="32"/>
  <Field id="_298" name="__value" type="_297" context="_66" access="public" location="f6:93" file="f6" line="93" offset="32"/>
  <Field id="_299" name="__pos" type="_31" context="_68" access="public" location="f7:23" file="f7" line="23" offset="0"/>
  <Field id="_300" name="__state" type="_67" context="_68" access="public" location="f7:24" file="f7" line="24" offset="64"/>
  <Field id="_301" name="__pos" type="_32" context="_70" access="public" location="f7:28" file="f7" line="28" offset="0"/>
  <Field id="_302" name="__state" type="_67" context="_70" access="public" location="f7:29" file="f7" line="29" offset="64"/>
  <FundamentalType id="_303" name="void" size="0" align="8"/>
  <Field id="_304" name="_next" type="_338" context="_76" access="public" location="f4:157" file="f4" line="157" offset="0"/>
  <Field id="_305" name="_sbuf" type="_314" context="_76" access="public" location="f4:158" file="f4" line="158" offset="64"/>
  <Field id="_306" name="_pos" type="_258" context="_76" access="public" location="f4:162" file="f4" line="162" offset="128"/>
  <FunctionType id="_307" returns="_55">
    <Argument type="_265"/>
    <Argument type="_253"/>
    <Argument type="_8"/>
  </FunctionType>
  <FunctionType id="_308" returns="_55">
    <Argument type="_265"/>
    <Argument type="_312"/>
    <Argument type="_8"/>
  </FunctionType>
  <FunctionType id="_309" returns="_258">
    <Argument type="_265"/>
    <Argument type="_344"/>
    <Argument type="_258"/>
  </FunctionType>
  <FunctionType id="_310" returns="_258">
    <Argument type="_265"/>
  </FunctionType>
  <PointerType id="_311" type="_78"/>
  <CvQualifiedType id="_311r" type="_311" restrict="1"/>
  <PointerType id="_312" type="_335c"/>
  <CvQualifiedType id="_312r" type="_312" restrict="1"/>
  <PointerType id="_313" type="_336"/>
  <PointerType id="_314" type="_63"/>
  <PointerType id="_315" type="_64"/>
  <CvQualifiedType id="_315r" type="_315" restrict="1"/>
  <PointerType id="_316" type="_303c"/>
  <CvQualifiedType id="_303c" type="_303" const="1"/>
  <CvQualifiedType id="_316r" type="_316" restrict="1"/>
  <PointerType id="_317" type="_105"/>
  <CvQualifiedType id="_317r" type="_317" restrict="1"/>
  <PointerType id="_318" type="_105c"/>
  <CvQualifiedType id="_105c" type="_105" const="1"/>
  <Field id="_319" name="_" type="_345" context="_194" access="public" location="f10:247" file="f10" line="247" offset="0"/>
  <FunctionType id="_320" returns="_303">
    <Argument type="_265"/>
    <Argument type="_265"/>
  </FunctionType>
  <PointerType id="_321" type="_195"/>
  <PointerType id="_322" type="_196"/>
  <PointerType id="_323" type="_8"/>
  <Field id="_324" name="socket" type="_265" context="_223" access="public" location="f10:447" file="f10" line="447" offset="0"/>
  <Field id="_325" name="fd" type="_258" context="_223" access="public" location="f10:451" file="f10" line="451" offset="64"/>
  <Field id="_326" name="events" type="_263" context="_223" access="public" location="f10:453" file="f10" line="453" offset="96"/>
  <Field id="_327" name="revents" type="_263" context="_223" access="public" location="f10:454" file="f10" line="454" offset="112"/>
  <PointerType id="_328" type="_224"/>
  <PointerType id="_329" type="_232"/>
  <PointerType id="_330" type="_159c"/>
  <CvQualifiedType id="_159c" type="_159" const="1"/>
  <PointerType id="_331" type="_159"/>
  <PointerType id="_332" type="_265"/>
  <FunctionType id="_333" returns="_303">
    <Argument type="_265"/>
  </FunctionType>
  <PointerType id="_334" type="_248"/>
  <CvQualifiedType id="_335c" type="_335" const="1"/>
  <Struct id="_336" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_346 _347 _348 _349" size="192" align="64"/>
  <ArrayType id="_337" min="0" max="1" type="_258"/>
  <PointerType id="_338" type="_76"/>
  <ArrayType id="_339" min="0" max="0" type="_335"/>
  <FundamentalType id="_335" name="char" size="8" align="8"/>
  <PointerType id="_340" type="_75"/>
  <ArrayType id="_341" min="0" max="19" type="_335"/>
  <Field id="_342" name="__wch" type="_261" context="_297" access="public" location="f6:88" file="f6" line="88" offset="0"/>
  <Field id="_343" name="__wchb" type="_350" context="_297" access="public" location="f6:92" file="f6" line="92" offset="0"/>
  <PointerType id="_344" type="_32"/>
  <ArrayType id="_345" min="0" max="63" type="_259"/>
  <Field id="_346" name="gp_offset" type="_261" context="_336" access="public" offset="0"/>
  <Field id="_347" name="fp_offset" type="_261" context="_336" access="public" offset="32"/>
  <Field id="_348" name="overflow_arg_area" type="_265" context="_336" access="public" offset="64"/>
  <Field id="_349" name="reg_save_area" type="_265" context="_336" access="public" offset="128"/>
  <ArrayType id="_350" min="0" max="3" type="_335"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="/usr/include/x86_64-linux-gnu/bits/errno.h"/>
  <File id="f2" name="/usr/share/castxml/clang/include/stddef.h"/>
  <File id="f3" name="/usr/include/x86_64-linux-gnu/bits/types.h"/>
  <File id="f4" name="/usr/include/libio.h"/>
  <File id="f5" name="/usr/include/stdio.h"/>
  <File id="f6" name="/usr/include/wchar.h"/>
  <File id="f7" name="/usr/include/_G_config.h"/>
  <File id="f8" name="/usr/share/castxml/clang/include/stdarg.h"/>
  <File id="f9" name="/usr/include/stdint.h"/>
  <File id="f10" name="zmq.h"/>
</GCC_XML>
